// 1.) เขียนฟังก์ชัน login ตรวจสอบตามลำดับ
function login(inputUser, inputPass, role, isActive, age) {
    // 1: ตรวจสอบ username หรือ password (ใช้เครื่องหมาย || แทนหรือ)
    if (inputUser !== "admin" || inputPass !== "ce385pass") {
        return "ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง";
    }
    // 2: ตรวจสอบบัญชีถูกระงับ (ใช้ === เทียบแบบเคร่งครัด)
    if (isActive === false) {
        return "บัญชีนี้ถูกระงับการใช้งาน";
    }
    // 3: ตรวจสอบอายุ
    if (age < 18) {
        return "อายุไม่ถึงเกณฑ์";
    }
    // 4 และ 5: ตรวจสอบสิทธิ์ (มาถึงตรงนี้ได้แปลว่ารหัสถูก บัญชีปกติ และอายุถึงแล้ว)
    if (role === "อาจารย์") {
        return "เข้าสู่ระบบสำเร็จ (สิทธ์ผู้ดูแล)";
    }
    else if (role === "นักศึกษา") {
        return "เข้าสู้ระบบสำเร็จ (สิทธิ์ทั่วไป)";
    }
    else {
        return "สิทธิ์ไม่ถูกต้อง" // ดักเผื่อกรณีส่ง role แปลกๆเข้ามา
    }
}

// 2.) ทดสอบอย่างน้อย 6 กรณี (นำ return จากฟังก์ชันมา console.log ข้างนอก)
console.log("===== Login =====");
console.log("1. สำเร็จ (อาจารย์) :", login("admin", "ce385pass", "อาจารย์", true, 35));
console.log("2. สำเร็จ (นักศึกษา) :", login("admin", "ce385pass", "นักศึกษา", true, 21));
console.log("3. รหัสผ่านผิด :", login("admin", "eiei", "นักศึกษา", true, 21));
console.log("4. ชื่อผู้ใช้ผิด :", login("admueng", "ce385pass", "อาจารย์", true, 42));
console.log("5. บัญชีถูกระงับ :", login("admin", "ce385pass", "อาจารย์", false, 38));
console.log("6. อายุไม่ถึง :", login("admin", "ce385pass", "นักศึกษา", true, 17));
console.log("=============================")

// ส่วนที่ 3 — ตอบคำถามท้ายข้อ
/*
1. ทำไมต้องตรวจ username/password ก่อน ตรวจ role?
ตอบ: เพราะระบบควรยืนยันตัวตนให้ผ่านก่อนว่าเป็นตัวจริง จึงค่อยตรวจสอบสิทธิ์
หากเช็คสิทธิ์ก่อน อาจเป็นการเปิดช่องโหว่ให้ผู้ไม่หวังดีรู้โครงสร้างข้อมูลภายในว่าระบบมี role อะไรบ้าง 
โดยที่คนคนนั้นยังไม่ได้ยืนยันตัวตนเลย

2. ถ้าย้ายการตรวจ "อายุไม่ถึงเกณฑ์" ขึ้นไปเป็นข้อแรกจะเกิดปัญหาอะไร? (คิดในแง่ความปลอดภัย: เราจะบอกอะไรกับคนยังไม่ได้พิสูจน์ตัวตน)
ตอบ: ในแง่ความปลอดภัย เราต้องไม่เปิดเผยข้อมูลหรือผลลัพธ์ใดๆให้กับคนแปลกหน้าที่ยังไม่ได้ยืนยันรหัสผ่าน 
หากเราดักเรื่องอายุก่อน แฮกเกอร์อาจสุ่มส่งข้อมูลมาเรื่อยๆ เพื่อตรวจสอบว่าระบบเราตั้งเกณฑ์อายุไว้ที่เท่าไหร่ 
เราจึงควรใช้การตอบกลับว่า "ชื่อผู้ใช้หรือรหัสผ่านผิด" สกัดไว้ตั้งแต่ด่านแรกสุด หรือหลอกนั่นเอง
*/